{
  "common": {
    "about": "About",
    "projects": "Projects",
    "experience": "Experience",
    "language-switcher": "Language switcher",
    "toggle-theme": "Theme toggle",
    "greeting": "Hello I’am Serhii Lisovyk,",
    "intro-topic": "I’m a frontend developer with over a year of hands-on experience. I build interfaces with Next.js, React and TypeScript and enjoy designing clear interface architecture and UX. I want users to quickly find the information they need and complete their tasks while the site stays lightweight, fast and easy to use on any device.",
    "address": "Dnipro / Ukraine",
    "profile-photo": "My profile photo",
    "my": "My",
    "skills": "Skills",
    "show-more": "Show more",
    "show-less": "Show less",
    "my-resume": "My resume",
    "experience-symfio": "I work as a Frontend Developer at a company that builds websites for car dealerships across different brands and markets. I help develop the vehicle catalog and product pages, parameter filters (make/model/year/mileage/price) and lead forms. I also update theming and contribute to our UI system based on Ant Design and Styled Components. I take part in CRM integrations, connecting inventory and price feeds, improving Core Web Vitals (image optimisation, lazy loading, SSR/ISR) and configuring metadata and OpenGraph. I closely collaborate with the backend via REST APIs: agreeing on data formats, composing requests with filters and pagination, and handling responses and loading/error states.",
    "pet": "Pet",
    "pet-projects": "Pet projects",
    "year-commercial-experience": "Year commercial experience",
    "quotes-text": "Full-stack PERN application for managing a collection of quotes. Users can get random quotes, browse the list, search by author, text, and tags, and also create, edit, and delete their own entries. The project covers the full data flow: REST API and database via ORM on the backend, and a clean UI with cards, search, and loading states on the frontend.",
    "quotes-image-alt": "Quotes project image",
    "pizza-text": "Full-stack MERN pizza store application. Users can browse pizzas with categories and sorting, search by name, switch catalogue pages, and add items to the cart while updating quantity and total price. The project showcases a complete e-commerce flow: a REST API with server-side filtering and pagination on the backend, and a TypeScript frontend powered by Redux Toolkit for global state and cart management.",
    "pizza-image-alt": "Pizza project image",
    "project-demo-soon": "Demo will be added soon...",
    "name-surname": "Serhii Lisovyk",
    "about-text": "I’m a frontend developer who enjoys working at the intersection of design and engineering. I like shaping interfaces so they feel clear to users while the implementation stays maintainable for the team. Clean architecture, predictable UX and attention to detail matter to me — from button states to how complex forms and filters behave. I feel comfortable both building product features and improving existing projects: performance optimisations, refactoring, introducing new components and integrating with backend services via REST APIs. I value good communication with the team, aligning on API contracts and shipping features to production together. I keep investing in my frontend skills through courses, practice and learning from others. I also have certificates and recommendations from colleagues and managers — you can find more details in my LinkedIn profile."
  }
}
