{
  "common": {
    "about": "About",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact",
    "language-switcher": "Language switcher",
    "toggle-theme": "Theme toggle",
    "greeting": "Hello I’am Serhii Lisovyk,",
    "intro-topic": "I’ve been building interfaces with Next.js, React and TypeScript for over a year. At a European company I’m responsible for the frontend of websites for car dealerships: vehicle catalogs, filters, lead forms, CRM integrations and more. I care about helping users quickly find the information they need and complete their tasks while the site stays lightweight, fast and easy to use on any device.",
    "address": "Dnipro / Ukraine",
    "profile-photo": "My profile photo",
    "my": "My",
    "skills": "Skills",
    "show-more": "Show more",
    "show-less": "Show less",
    "my-resume": "My resume",
    "detailed-about-me": "Detailed about me",
    "profile": "Profile",
    "certificates": "Certificates",
    "recommendations": "Recommendations",
    "pet": "Pet",
    "quotes-text": "Full-stack PERN application for managing a collection of quotes. Users can get random quotes, browse the list, search by author, text, and tags, and also create, edit, and delete their own entries. The project covers the full data flow: REST API and database via ORM on the backend, and a clean UI with cards, search, and loading states on the frontend.",
    "quotes-image-alt": "Quotes project image",
    "pizza-text": "Full-stack MERN pizza store application. Users can browse pizzas with categories and sorting, search by name, switch catalogue pages, and add items to the cart while updating quantity and total price. The project showcases a complete e-commerce flow: a REST API with server-side filtering and pagination on the backend, and a TypeScript frontend powered by Redux Toolkit for global state and cart management.",
    "pizza-image-alt": "Pizza project image",
    "project-demo-soon": "Demo will be added soon...",
    "name-surname": "Serhii Lisovyk",
    "lets": "Let’s",
    "talk": "talk",
    "for": "for",
    "something-special": "Something special",
    "footer-topic": "I seek to push the limits of creativity to create high-engaging, user-friendly, and memorable interactive experiences."
  }
}
