{
  "common": {
    "about": "Обо мне",
    "projects": "Проекты",
    "experience": "Опыт",
    "contact": "Контакты",
    "language-switcher": "Сменить язык",
    "toggle-theme": "Переключить тему",
    "greeting": "Привет, меня зовут Сергей Лeсовик, и я",
    "intro-topic": "Уже более года я разрабатываю интерфейсы на Next.js, React и TypeScript. В европейской компании отвечаю за фронтенд сайтов для автомобильных дилерских центров: каталоги авто, фильтры, формы лидов, интеграции с CRM и многое другое. Мне важно, чтобы пользователь быстро находил нужную информацию и решал свои задачи, а сайт оставался лёгким, быстрым и понятным на любых устройствах.",
    "address": "Днепр / Украина",
    "profile-photo": "Моё фото профиля",
    "my": "Мои",
    "skills": "Навыки",
    "show-more": "Показать больше",
    "show-less": "Показать меньше",
    "my-resume": "Мое резюме",
    "detailed-about-me": "Подробнее о мне",
    "profile": "Профиль",
    "certificates": "Сертификаты",
    "recommendations": "Рекомендации",
    "pet": "Пет",
    "quotes-text": "Full-stack PERN приложение для работы с коллекцией цитат. Пользователь может получать случайные цитаты, просматривать список, искать по автору, тексту и тегам, а также добавлять, редактировать и удалять свои записи. Проект покрывает полный цикл работы с данными: от REST API и базы через ORM до удобного интерфейса с карточками, поиском и состояниями загрузки.",
    "quotes-image-alt": "Изображение проекта цитат",
    "pizza-text": "Full-stack MERN приложение интернет-магазина пиццы. Пользователь может просматривать список пицц с категориями и сортировкой, искать по названию, переключать страницы каталога и добавлять товары в корзину, изменяя количество и общую стоимость. Проект демонстрирует полный цикл e-commerce логики: от REST API с фильтрацией и пагинацией до фронтенда на TypeScript с глобальным состоянием через Redux Toolkit и управлением корзиной.",
    "pizza-image-alt": "Изображение проекта пиццы",
    "project-demo-soon": "Демо будет добавлено скоро...",
    "name-surname": "Сергей Лeсовик",
    "lets": "Давайте",
    "talk": "поговорим",
    "for": "о",
    "something-special": "Чём-то особенном",
    "footer-topic": "Я стремлюсь расширять границы креативности, создавать увлекательные, удобные и запоминающиеся проекты."
  }
}
