{
  "common": {
    "about": "Обо мне",
    "projects": "Проекты",
    "experience": "Опыт",
    "language-switcher": "Сменить язык",
    "toggle-theme": "Переключить тему",
    "greeting": "Привет, меня зовут Сергей Лeсовик, и я",
    "intro-topic": "Я фронтенд-разработчик с более чем годом коммерческого опыта. Разрабатываю интерфейсы на Next.js, React и TypeScript и люблю выстраивать понятную архитектуру интерфейсов и UX. Мне важно, чтобы пользователь быстро находил нужную информацию и решал свои задачи, а сайт оставался лёгким, быстрым и понятным на любых устройствах.",
    "address": "Днепр / Украина",
    "profile-photo": "Моё фото профиля",
    "my": "Мои",
    "skills": "Навыки",
    "show-more": "Показать больше",
    "show-less": "Показать меньше",
    "my-resume": "Моё резюме",
    "experience-symfio": "Работаю фронтенд-разработчиком в компании, которая создаёт сайты для автодилеров под разные бренды и рынки. Помогаю развивать каталог и карточки автомобилей, фильтры по параметрам (марка/модель/год/пробег/цена) и формы лидов, а также участвую в развитии UI-системы на базе Ant Design и Styled Components. Принимаю участие в интеграциях с CRM, подключаю фиды с наличием автомобилей и ценами, улучшаю Core Web Vitals (оптимизация изображений, lazy-loading, SSR/ISR). Плотно взаимодействую с бекендом через REST-API: согласовываю форматы данных, составляю запросы с фильтрами и пагинацией, обрабатываю ответы и состояния загрузки и ошибок.",
    "pet": "Пет",
    "quotes-text": "Фулстек-приложение на PERN для ведения коллекции цитат. Пользователь может получать случайные цитаты, просматривать список, искать по автору, тексту и тегам, а также создавать, редактировать и удалять собственные записи. Проект покрывает полный цикл работы с данными: REST-API и база данных через ORM на бэкенде и аккуратный интерфейс с карточками, поиском и состояниями загрузки на фронтенде.",
    "quotes-image-alt": "Изображение проекта цитат",
    "pizza-text": "Фулстек-приложение на MERN для онлайн-пиццерии. Пользователь может просматривать пиццы с категориями и сортировкой, искать по названию, переключать страницы каталога и добавлять позиции в корзину с обновлением количества и итоговой суммы. Проект показывает полный e-commerce-флоу: REST-API с серверной фильтрацией и пагинацией на бэкенде и TypeScript-фронтенд на Redux Toolkit для глобального состояния и управления корзиной.",
    "pizza-image-alt": "Изображение проекта пиццы",
    "project-demo-soon": "Демо будет добавлено скоро...",
    "name-surname": "Сергей Лeсовик",
    "about-text": "Я фронтенд-разработчик, которому нравится работать на стыке дизайна и разработки. Для меня важно, чтобы интерфейсы были понятными для пользователей, а реализация — поддерживаемой для команды. Чистая архитектура, предсказуемый UX и внимание к деталям для меня принципиальны — от состояний кнопок до поведения сложных форм и фильтров. Мне комфортно как развивать продуктовые фичи, так и улучшать существующие проекты: оптимизировать производительность, заниматься рефакторингом, внедрять новые компоненты и интегрироваться с бэкенд-сервисами через REST-API. Ценю понятную коммуникацию в команде, договорённости по контрактам API и совместный довод фич до продакшена. Я постоянно вкладываюсь в развитие фронтенд-скиллов через практику, курсы и обмен опытом с другими разработчиками. У меня есть пройденные курсы, сертификаты и рекомендации от коллег и менеджеров — подробнее с ними можно ознакомиться в моём профиле LinkedIn."
  }
}
