{
  "common": {
    "about": "Обо мне",
    "projects": "Проекты",
    "experience": "Опыт",
    "language-switcher": "Сменить язык",
    "toggle-theme": "Переключить тему",
    "greeting": "Привет, меня зовут Сергей Лeсовик, и я",
    "intro-topic": "Я фронтенд-разработчик с более чем годом практического опыта. Разрабатываю интерфейсы на Next.js, React и TypeScript и люблю выстраивать понятную архитектуру интерфейсов и UX. Мне важно, чтобы пользователь быстро находил нужную информацию и решал свои задачи, а сайт оставался лёгким, быстрым и понятным на любых устройствах.",
    "address": "Днепр / Украина",
    "profile-photo": "Моё фото профиля",
    "my": "Мои",
    "skills": "Навыки",
    "show-more": "Показать больше",
    "show-less": "Показать меньше",
    "my-resume": "Моё резюме",
    "experience-symfio": "Работаю фронтенд-разработчиком в компании, которая создаёт сайты для автодилеров под разные бренды и рынки. Помогаю создавать каталог и карточку авто, фильтры по параметрам (марка/модель/год/пробег/цена) и формы лидов. Занимаюсь обновлением темизации и помогаю развивать UI-систему на базе Ant Design и Styled Components. Участвую в интеграциях с CRM, подключении фидов с наличием автомобилей и ценами, улучшаю Core Web Vitals (оптимизация изображений, lazy-loading, SSR/ISR), настраиваю метаданные и OpenGraph. Плотно взаимодействую с бэкендом по REST-API: согласовываю форматы данных, собираю запросы с фильтрами и пагинацией, обрабатываю ответы и состояния загрузки/ошибок.",
    "pet": "Пет",
    "quotes-text": "Full-stack PERN приложение для работы с коллекцией цитат. Пользователь может получать случайные цитаты, просматривать список, искать по автору, тексту и тегам, а также добавлять, редактировать и удалять свои записи. Проект покрывает полный цикл работы с данными: от REST API и базы через ORM до удобного интерфейса с карточками, поиском и состояниями загрузки.",
    "quotes-image-alt": "Изображение проекта цитат",
    "pizza-text": "Full-stack MERN приложение интернет-магазина пиццы. Пользователь может просматривать список пицц с категориями и сортировкой, искать по названию, переключать страницы каталога и добавлять товары в корзину, изменяя количество и общую стоимость. Проект демонстрирует полный цикл e-commerce логики: от REST API с фильтрацией и пагинацией до фронтенда на TypeScript с глобальным состоянием через Redux Toolkit и управлением корзиной.",
    "pizza-image-alt": "Изображение проекта пиццы",
    "project-demo-soon": "Демо будет добавлено скоро...",
    "name-surname": "Сергей Лeсовик",
    "about-text": "Я фронтенд-разработчик, которому нравится работать на стыке дизайна и разработки. Люблю продумывать интерфейсы так, чтобы они были понятны пользователю, а реализация — прозрачна для команды. В работе для меня важны аккуратная архитектура, предсказуемый UX и внимание к деталям: от состояний кнопок до поведения сложных форм и фильтров. Мне комфортно как в продуктовой работе, так и в задачах по доработке и оптимизации существующих проектов: улучшение производительности, рефакторинг, внедрение новых компонентов, взаимодействие с бэкендом по REST-API. Нравится, когда есть возможность обсудить решение с командой, договориться о контракте API и вместе довести фичу до продакшена. Я постоянно учусь и развиваю свои навыки во фронтенде. У меня есть пройденные курсы и сертификаты, а также рекомендации от коллег и менеджеров — всё это можно подробнее посмотреть в моём профиле LinkedIn."
  }
}
