{
  "common": {
    "about": "Про мене",
    "projects": "Проєкти",
    "experience": "Досвід",
    "language-switcher": "Змінити мову",
    "toggle-theme": "Переключити тему",
    "greeting": "Привіт, мене звати Сергій Лісовик, я",
    "intro-topic": "Я фронтенд-розробник із понад роком комерційного досвіду. Створюю інтерфейси на Next.js, React та TypeScript і люблю вибудовувати зрозумілу архітектуру інтерфейсів та UX. Для мене важливо, щоб користувач швидко знаходив потрібну інформацію та вирішував свої задачі, а сайт залишався легким, швидким і зрозумілим на будь-яких пристроях.",
    "address": "Дніпро / Україна",
    "profile-photo": "Моє фото профілю",
    "my": "Мої",
    "skills": "Навички",
    "show-more": "Показати більше",
    "show-less": "Показати менше",
    "my-resume": "Мое резюме",
    "experience-symfio": "Працюю фронтенд-розробником у компанії, що створює сайти для автодилерів під різні бренди та ринки. Допомагаю розвивати каталог і картки автомобілів, фільтри за параметрами (марка/модель/рік/пробіг/ціна) та форми лідів, а також беру участь у розвитку UI-системи на основі Ant Design і Styled Components. Беру участь в інтеграціях із CRM, підключаю фіди з наявністю автомобілів і цінами, покращую Core Web Vitals (оптимізація зображень, lazy-loading, SSR/ISR). Тісно взаємодію з бекендом через REST-API: узгоджую формати даних, формую запити з фільтрами та пагінацією, обробляю відповіді й стани завантаження та помилок.",
    "pet": "Пет",
    "quotes-text": "Фулстек-застосунок на PERN для ведення колекції цитат. Користувач може отримувати випадкові цитати, переглядати список, шукати за автором, текстом і тегами, а також створювати, редагувати й видаляти власні записи. Проєкт охоплює повний цикл роботи з даними: REST-API та база даних через ORM на бекенді й акуратний інтерфейс із картками, пошуком та станами завантаження на фронтенді.",
    "quotes-image-alt": "Зображення проекту цитат",
    "pizza-text": "Фулстек-застосунок на MERN для онлайн-піцерії. Користувач може переглядати піци з категоріями та сортуванням, шукати за назвою, перемикати сторінки каталогу й додавати позиції до кошика з оновленням кількості та підсумкової суми. Проєкт демонструє повний e-commerce-флоу: REST-API з серверною фільтрацією та пагінацією на бекенді та TypeScript-фронтенд на Redux Toolkit для глобального стану й управління кошиком.",
    "pizza-image-alt": "Зображення проекту піци",
    "project-demo-soon": "Демо буде додано скоро...",
    "name-surname": "Сергій Лісовик",
    "about-text": "Я фронтенд-розробник, якому подобається працювати на стику дизайну та інженерії. Для мене важливо, щоб інтерфейси були зрозумілими для користувачів, а реалізація — підтримуваною для команди. Чиста архітектура, передбачуваний UX і увага до деталей для мене принципові — від станів кнопок до поведінки складних форм і фільтрів. Мені комфортно як розвивати продуктові фічі, так і покращувати наявні проєкти: оптимізувати продуктивність, робити рефакторинг, запроваджувати нові компоненти та інтегруватися з бекенд-сервісами через REST-API. Ціную прозору комунікацію в команді, узгоджені контракти API та спільне доведення фіч до продакшену. Я постійно інвестую у свої фронтенд-навички через практику, курси й обмін досвідом з іншими розробниками. Маю пройдені курси, сертифікати та рекомендації від колег і менеджерів — детальніше з ними можна ознайомитися в моєму профілі LinkedIn."
  }
}
