{
  "common": {
    "about": "Про мене",
    "projects": "Проекти",
    "experience": "Досвід",
    "language-switcher": "Змінити мову",
    "toggle-theme": "Переключити тему",
    "greeting": "Привіт, мене звати Сергій Лісовик, я",
    "intro-topic": "Я фронтенд-розробник із понад роком практичного досвіду. Працюю з Next.js, React та TypeScript і люблю вибудовувати зрозумілу архітектуру інтерфейсів та UX. Для мене важливо, щоб користувач швидко знаходив потрібну інформацію та вирішував свої задачі, а сайт залишався легким, швидким і зрозумілим на будь-яких пристроях.",
    "address": "Дніпро / Україна",
    "profile-photo": "Моє фото профілю",
    "my": "Мої",
    "skills": "Навички",
    "show-more": "Показати більше",
    "show-less": "Показати менше",
    "my-resume": "Мое резюме",
    "experience-symfio": "Працюю фронтенд-розробником у компанії, що створює сайти для автодилерів під різні бренди та ринки. Допомагаю розробляти каталог і картку авто, фільтри за параметрами (марка/модель/рік/пробіг/ціна) та форми лідів. Займаюся оновленням темізації та допомагаю розвивати UI-систему на основі Ant Design і Styled Components. Беру участь в інтеграціях із CRM, підключенні фідів із наявністю автомобілів і цінами, покращую Core Web Vitals (оптимізація зображень, lazy-loading, SSR/ISR), налаштовую метадані та OpenGraph. Тісно взаємодію з бекендом через REST-API: узгоджую формати даних, формую запити з фільтрами та пагінацією, обробляю відповіді й стани завантаження/помилок.",
    "pet": "Пет",
    "pet-projects": "Пет проєктів",
    "year-commercial-experience": "Рік комерційного досвіду",
    "quotes-text": "Full-stack PERN застосунок для роботи з колекцією цитат. Користувач може отримувати випадкові цитати, переглядати список, шукати за автором, текстом і тегами, а також додавати, редагувати й видаляти власні записи. Проєкт демонструє повний цикл роботи з даними: від REST API та бази через ORM до зручного інтерфейсу з картками, пошуком і станами завантаження.",
    "quotes-image-alt": "Зображення проекту цитат",
    "pizza-text": "Full-stack MERN застосунок інтернет-магазину піци. Користувач може переглядати список піц із категоріями та сортуванням, шукати за назвою, перемикати сторінки каталогу й додавати товари до кошика, змінюючи кількість і загальну вартість. Проєкт демонструє повний e-commerce цикл: REST API з фільтрацією та пагінацією на бекенді та фронтенд на TypeScript із глобальним станом через Redux Toolkit і керуванням кошиком.",
    "pizza-image-alt": "Зображення проекту піци",
    "project-demo-soon": "Демо буде додано скоро...",
    "name-surname": "Сергій Лісовик",
    "about-text": "Я фронтенд-розробник, якому подобається працювати на стику дизайну та розробки. Люблю продумувати інтерфейси так, щоб вони були зрозумілими для користувача, а реалізація — прозорою для команди. У роботі для мене важливі охайна архітектура, передбачуваний UX та увага до деталей: від станів кнопок до поведінки складних форм і фільтрів. ені комфортно як у продуктовій роботі, так і в задачах із доопрацювання та оптимізації існуючих проєктів: покращення продуктивності, рефакторинг, впровадження нових компонентів, взаємодія з бекендом через REST-API. Подобається, коли є можливість обговорити рішення з командою, узгодити контракт API та разом довести фічу до продакшену. Я постійно навчаюся та розвиваю свої навички у фронтенді. Маю пройдені курси й сертифікати, а також рекомендації від колег і менеджерів — детальніше з ними можна ознайомитися в моєму профілі LinkedIn."
  }
}
